package lab_6;

public class task_2 {
    public static void main() {
    }
}
/*
    Для програми розробленої у ході виконання лабораторної роботи №1(частина 3) розробити візуальний інтерфейс засобами бібліотеки Swing.
    У програмі використати такі компоненти: JFrame, JPanel, JButton, JLable, JTextField, JTable.
    Передбачити читання вхідних даних з файлу.
    Програма повинна включати обробку виключних ситуацій.
    Обробити 3 типи виключень: 2 стандартних і 1 власне.
    Зі стандартних виключень можна взяти виключення пов’язане з відкриттям файлу і невірним форматом вхідних даних.
    Для власного виключення потрібно розробити клас наслідуваний від класу ArithmeticException.
    В програмі передбачити генерацію власного виключення при певних вхідних даних (придумати самостійно).
*/