package lab_5;

public class task_1 {
    public static void main() {
    }
}
/*
    Розробити програму керування записами, створеними на основі похідних класів з попередньої лабораторної роботи №3.
    Програма повинна прочитати вхідні дані (список записів) з файлів (для кожного класу свій файл) і занести їх у колекції відповідного типу (ArrayList).
    Вивести прочитані дані.
    Відсортувати їх за допомогою Collections.sort(), для цього додати у класи реалізацію інтерфейсу Comparable (порівняння записів придумати самостійно).
    Вивести дані на екран.
    Додати по одному запису у кожну колекцію введеному з клавіатури.
    Знову відсортувати і вивести на екран.
    Описати ArrayList на основі абстрактного класу і занести у нього усі записи з файлів (або з попередньо створених колекцій).
    Відсортувати отриманий ArrayList за допомогою Collections.sort(),
    у який передати об’єкт класу, похідний від Comparator (розробити самостійно),
    який буде вміти порівнювати об’єкти абстрактного класу. Відсортований ArrayList записати у файл.
*/