package lab_7;

public class task_2 {
    public static void main() {
    }
}
/*
Доопрацювати програму, створену в лабораторній роботі №3(3.1/3.2, за вибором студента):

1) Створити абстрактний клас BaseAI, що описує «інтелектуальне поведінка» об'єктів за спрощеним варіантом.
Клас повинен бути виконаний у вигляді окремого потоку і працювати з колекцією об'єктів;

2) реалізувати клас BaseAI для кожного з видів об'єкта, включивши в нього поведінка, описане в індивідуальному завданні за варіантом;

3) синхронізувати роботу потоків розрахунку інтелекту об'єктів з їх малюванням. Малювання повинно залишитися в основному потоці.
Синхронізація здійснюється через передачу даних в основний потік;

4) додати в панель управління кнопки для зупинки і відновлення роботи інтелекту кожного виду об'єктів.
Реалізувати через засипання / пробудження потоків;

5) додати в панель управління випадають списки для виставлення пріоритетів кожного зпотоків
*/